Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/travel_and_recreation/roads_and_safety/school_traffic_wardens_in_ireland.html.txt.tmx
Source language: en
Languages: ga

source: Every local authority can make arrangements with the Commissioner of an Garda Siochana for the patrolling of places where school children cross public roads
ga: Is féidir le gach údarás áitiúil socruithe a dhéanamh le Coimisinéir an Gharda Síochána patról a chuir i bhfeidhm in áiteanna ina dtrasnaíonn páistí scoile bóithre poiblí

source: Those who patrol these places are known as School Traffic Wardens
ga: Tugtar Maoir Tráchta Scoile ar na daoine a dhéanann patról ar na háiteanna seo

source: Their role is to ensure that school children cross public roads on their way to/from school safely
ga: Is é an ról atá acu ná a chinntiú go dtrasnaíonn páistí scoile bóithre poiblí ar a mbealach go dtí an scoil agus ar ais ón scoil go sábháilte

source: In general, School Traffic Wardens only patrol areas where primary school (and not secondary school children) cross public roads
ga: Go hiondúil déanann Maoir Tráchta Scoile patról ar áiteanna ina thrasnaíonn páistí bunscoile amháin (níl an córas i bhfeidhm do pháistí meánscoile)

source: Together with the Gardai (Irish police force), School Traffic Wardens are the only officials in Ireland who have the authority to stop other vehicles on public roads
ga: Is iad Maoir Tráchta Scoile agus an Gharda Síochána amháin na hoifigigh a bhfuil údarás acu feithiclí eile ar bhóithre poiblí a stopadh

source: The law governing the appointment of School Traffic Wardens is (Section 96) of the Road Traffic Act, 1961
ga: Is é an dlí a rialaíonn ceapachán Maor Tráchta Scoile ná (Rannóg 96) den Acht um Thrácht ar Bhóithre 1961

source: School Traffic Wardens usually work in the mornings, at lunchtime and in the evenings when children are most likely to cross the road to go to/from school
ga: De ghnáth, oibríonn Maoir Tráchta Scoile ar maidin, ag am lóin agus um thráthnóna nuair is cosúla go dtrasnóidh páistí an bhóthair ar a mbealach go dtí/ón scoil

source: School Traffic Wardens wear a distinctive uniform (a high-visability coat and hat)
ga: Caitheann Maoir Tráchta Scoile culaith shainiúil (cóta agus hata shofheicthe)

source: Wardens must also carry a distinctive sign (a white disc with a red border and the words "Stop" in the centre)
ga: Ní mór do Mhaoir comhartha sainiúil a iompar chomh maith (diosca bán le himeall dearg agus an focal "Stop" sa lár)

source: The School Traffic Warden has the power to exhibit the sign thereby requiring all traffic to stop and remain stopped to enable school children to cross the road in safety
ga: Tá an chumhacht ag an Maor Tráchta Scoile an comhartha a thaispeáint agus ar an gcaoi sin a éileamh ar an trácht ar fad stopadh agus fanacht stoptha chun go mbeidh páistí scoile in ann an bóthar a thrasnú go sábháilte

source: Traffic must remain stopped as long as the Warden exhibits the sign
ga: Caithfidh an trácht a fhanacht stoptha fad is atá an comhartha á thaispeáint ag an Maor

source: Junior Traffic Wardens Scheme
ga: Scéim na Maor Tráchta Sóisearach

source: In many places, Junior Traffic Wardens (usually senior pupils of primary schools) operate in teams to provide the same service as the School Traffic Warden
ga: Feidhmíonn Maoir Tráchta Sóisearacha (go hiondúil dáltaí sinsearacha na mbunscoileanna) i bhfoirne i go leor ceantracha chun an tseirbhís céanna a chur ar fáil agus a dhéanann an Maor Tráchta Scoile

source: Junior Traffic Wardens operate in teams of six and a signal requesting traffic to stop is given from both sides of the road
ga: Feidhmíonn Maoir Tráchta Sóisearacha i bhfoirne de sheisear agus tugtar comhartha ag iarraidh ar an trácht stopadh as an dá thaobh den bhóthar

source: After traffic stops, the six Junior Traffic Wardens take up their position and guide younger children across the public road
ga: Nuair a stopann an trácht, tógann an seisear Maor Tráchta Sóisearach a n-áiteanna agus treoraíonn siad páistí níos óige trasna an bhóthair phoiblí

source: All vehicles must remain stopped until all the Junior Traffic Wardens have returned to the footpath
ga: Ní mór d’fheithiclí ar fad fanacht stoptha go dtí go bhfilleann na Maoir Tráchta Sóisearacha ar fad ar an gcosán

source: To ensure that Junior Traffic Wardens can carry out their function properly, it is vital that they have a clear view of the road
ga: Tá sé riachtanach go mbíonn radharc soiléir ar an mbóthar ag na Maoir Tráchta Sóisearacha ar fad ionas go mbeidh siad in ann a ndualgais a chomhlíonadh i gceart

source: Drivers should never stop or park in positions where they could obstruct the view of Junior Traffic Wardens or School Traffic Wardens
ga: Ní cheart go stopfaidh tiománaithe ná go bpáirceálfaidh siad ionas go gcuirfidh siad isteach ar radharc na Maor Tráchta Sóisearach ná na Maor Tráchta Scoile

source: School Traffic Wardens can only stop vehicles on a public road if they are wearing the appropriate uniform and exhibiting the appropriate sign
ga: Ní féidir le Maor Tráchta Scoile feithiclí a stopadh ar an mbóthar poiblí ach amháin nuair atá siad ag caitheamh na culaithe cuí agus ag taispeáint an chomhartha chuí

source: A person who fails to stop a vehicle or animal or keep it stopped in accordance with subsection with Section 96 of the Road Traffic Act, 1961 is guilty of an offence
ga: Tá aon duine a theipeann air/uirtha feithicil nó ainmhí a stopadh, nó a choinneáil stoptha de réir Rannóg 96 den Acht um Thrácht ar Bhóithre, 1961, ciontach i gcoir

source: Before commencing duty as a School Traffic Warden, each Warden must undergo a comprehensive training programme about road safety and their duties, organised through their local authority
ga: Ní mór do gach Maor clár oilúna cuimsitheach faoi shábháilteacht ar bhóithre agus faoina gcuid dualgas a dhéanamh sula dtosaíonn siad ar a ndualgais mar Mhaor Tráchta Scoile. Reachtáileann an t-údarás áitiúil na cláir

source: School Traffic Wardens are employees of your local authority
ga: Is fostaithe d'údarás áitiúil iad Maoir Tráchta Scoile

source: These employees receive remuneration (pay) for their duties and are generally employed on a part-time basis with a maximum number of hours per week
ga: Faigheann na fostaithe pá ar a ndualgais agus go hiondúil bíonn siad fostaithe ar bhonn páirtaimseartha le huasmhéid uaireanta in aghaidh na seachtaine

source: Payment rates are available from the Corporate Services Section (HR Department) of your local authority
ga: Tá na rátaí pá ar fáil ó Rannóg na Seirbhísí Corparáideach (Roinn na n-Acmhainní Daonna) i d'údarás áitiúil

source: In general, if an employee is capable of carrying out their duties satisfactorily, there may be flexibility as to the upper age of employees (i.e., they may be over 65 years)
ga: Go hiondúil, más féidir le fostaí a c(h)uid dualgas a chomhlíonadh go sásúil, b'fhéidir go mbeifear solúbtha maidir le huasaois na bhfostaithe (is é sin, d'fhéadfaidís a bheith os cionn 65 bliain d’aois)

source: Local authorities routinely advertise for positions such as School Traffic Wardens in their areas
ga: Fógraíonn údaráis áitiúla postanna ar nós Maor Tráchta Scoile ina gceantracha go rialta

source: These advertisements are normally carried in your local or national newspapers, parish or community newsletter or on local radio
ga: Cuirfear na fógraí seo de ghnáth sna nuachtáin áitiúla nó náisiúnta, nuachtlitir an pharóiste nó an phobail nó ar an raidió áitiúil

source: Further information on upcoming vacancies or requirements for employment as a School Traffic Warden is available directly from your local authority
ga: Is féidir tuilleadh eolais faoi folúntais le teacht nó faoi na riachtanais a bhaineann le fostaíocht mar Mhaor Tráchta Scoile a fháil ó d’údarás áitiúil
